In [59]:
# DoL
topnames = {'year':[2018,2018,2017,2017,2016,2016],
           'sex':['Male','Female','Male','Female','Male','Female'],
           'name':['Liam','Emma','Liam','Emma','Noah','Emma'],
           'count':[19837,18688,18798,19800,19117,1996]}

In [60]:
topnames

{'year': [2018, 2018, 2017, 2017, 2016, 2016],
 'sex': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'],
 'name': ['Liam', 'Emma', 'Liam', 'Emma', 'Noah', 'Emma'],
 'count': [19837, 18688, 18798, 19800, 19117, 1996]}

In [61]:
topnames['year']

[2018, 2018, 2017, 2017, 2016, 2016]

In [62]:
[topnames['year'][3],topnames['sex'][3],topnames['name'][3],topnames['count'][3]]

[2017, 'Female', 'Emma', 19800]

In [69]:
mylist = []
for x in topnames.values():
    mylist.append(x[3])
    
mylist[0]

2017

In [40]:
# LoL
topnames = [[2018,'Male','Liam',19837],
           [2018,'Female','Emma',18688],
           [2017,'Male','Liam',18798],
           [2017,'Female','Emma',19800],
           [2016,'Male','Noah',19117],
           [2016,'Female','Emma',19496]]

In [35]:
topnames[3]

[2017, 'Female', 'Emma', 19800]

In [42]:
my_row = []
# return the year col
for i in range(len(topnames)):
    my_row.append(topnames[i][0])
my_row

[2018, 2018, 2017, 2017, 2016, 2016]

In [47]:
# work with pandas instead
import pandas as pd
# Pandas dataframe
df = pd.DataFrame(topnames,columns=['year','sex','name','count'])
df

   year     sex  name  count
0  2018    Male  Liam  19837
1  2018  Female  Emma  18688
2  2017    Male  Liam  18798
3  2017  Female  Emma  19800
4  2016    Male  Noah  19117
5  2016  Female  Emma  19496

In [49]:
# very easy to access cols
print(df.iloc[:,0]) # returns the year col using index location
print(df['year']) # likewise, but using col name

0    2018
1    2018
2    2017
3    2017
4    2016
5    2016
Name: year, dtype: int64
0    2018
1    2018
2    2017
3    2017
4    2016
5    2016
Name: year, dtype: int64

In [51]:
# very easy to access rows too!
df.iloc[3,:]

year       2017
sex      Female
name       Emma
count     19800
Name: 3, dtype: object

In [53]:
print(df.iloc[3,:][0]) # data in row 3 col 1
print(df['year'][3]) # same info

2017
2017

In [54]:
type(df) # df is a DataFrame object

pandas.core.frame.DataFrame

In [56]:
type(df['year']) # Pandas Series are arrays like in numpy

pandas.core.series.Series

In [58]:
df['year']*2 # broadcasting here works because pandas is built on numpy

0    4036
1    4036
2    4034
3    4034
4    4032
5    4032
Name: year, dtype: int64

In [3]:
import pandas as pd
# data about dogs, as DoL
DataDoL={'name':['Bella','Charlie','Lucy','Coooper','Max','Stella','Bernie'], 
 'breed':['Labrador','Poodle','ChowChow','Schnauzer','Labrador',
 'Chihuahua','St.Bernard'],
 'color': ['Brown','Black','Brown','Gray','Black','Tan','White'],
 'height_cm':[56,43,46,49,59,18,77],
 'weight_kg':[24,24,24,17,29,2,74],
 'date_of_birth':['2013-07-01','2016-09-16','2014-08-25',
 '2011-12-11','2017-01-28','2015-04-20',
 '2018-02-27']}

df = pd.DataFrame(DataDoL)
df

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27

In [5]:
df.info() # gives you bunch of useful info about your df object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           7 non-null      object
 1   breed          7 non-null      object
 2   color          7 non-null      object
 3   height_cm      7 non-null      int64
 4   weight_kg      7 non-null      int64
 5   date_of_birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes

In [6]:
df.describe() # bunch of useful stats to look at, also exist in R

       height_cm  weight_kg
count   7.000000   7.000000
mean   49.714286  27.714286
std    17.960274  22.216468
min    18.000000   2.000000
25%    44.500000  20.500000
50%    49.000000  24.000000
75%    57.500000  26.500000
max    77.000000  74.000000

In [12]:
# row index?
print(df.index) # returns the row index

# choosing cols
print(df['name'])
print(df.name) # equivalent to above. but only if your col name consists of characters excluding whitespace, dashes etc.
df.index = df.name

RangeIndex(start=0, stop=7, step=1)
0      Bella
1    Charlie
2       Lucy
3    Coooper
4        Max
5     Stella
6     Bernie
Name: name, dtype: object
0      Bella
1    Charlie
2       Lucy
3    Coooper
4        Max
5     Stella
6     Bernie
Name: name, dtype: object

In [17]:
print(df) # notice name col is a duplicate and redundant col now, so how to delete?
#del df['name'] # does the job but not recommended because it's not the pandas way of doing it
df = df.drop(columns=['name']) # use this syntax, it does not overwrite, so you'd need to assign to your df
print(df)

            name       breed  color  height_cm  weight_kg date_of_birth
name
Bella      Bella    Labrador  Brown         56         24    2013-07-01
Charlie  Charlie      Poodle  Black         43         24    2016-09-16
Lucy        Lucy    ChowChow  Brown         46         24    2014-08-25
Coooper  Coooper   Schnauzer   Gray         49         17    2011-12-11
Max          Max    Labrador  Black         59         29    2017-01-28
Stella    Stella   Chihuahua    Tan         18          2    2015-04-20
Bernie    Bernie  St.Bernard  White         77         74    2018-02-27
              breed  color  height_cm  weight_kg date_of_birth
name
Bella      Labrador  Brown         56         24    2013-07-01
Charlie      Poodle  Black         43         24    2016-09-16
Lucy       ChowChow  Brown         46         24    2014-08-25
Coooper   Schnauzer   Gray         49         17    2011-12-11
Max        Labrador  Black         59         29    2017-01-28
Stella    Chihuahua    Tan         18          2    2015-04-20
Bernie   St.Bernard  White         77         74    2018-02-27

In [ ]:
# accesing values in a df
# iloc method uses index location
# loc method can use string

In [20]:
df.loc['Bella'] # works because names are set up as row index

breed              Labrador
color                 Brown
height_cm                56
weight_kg                24
date_of_birth    2013-07-01
Name: Bella, dtype: object

In [21]:
df.shape # returns that our df has 7 rows and 5 cols

(7, 5)

In [31]:
# filtering data, 
print(df[df.height_cm>50]) # filtering based on a numeric column
# in R: df[df$height_cm>50], dplyr: df %>% filter(height_cm>50)
print(df[df.date_of_birth>'2015-01-01'])# filtering based on a date, 2015-01-01

             breed  color  height_cm  weight_kg date_of_birth
name
Bella     Labrador  Brown         56         24    2013-07-01
Max       Labrador  Black         59         29    2017-01-28
Bernie  St.Bernard  White         77         74    2018-02-27
              breed  color  height_cm  weight_kg date_of_birth
name
Charlie      Poodle  Black         43         24    2016-09-16
Max        Labrador  Black         59         29    2017-01-28
Stella    Chihuahua    Tan         18          2    2015-04-20
Bernie   St.Bernard  White         77         74    2018-02-27

In [ ]:
# btw, is date_of_birth col string?
print(type(df.date_of_birth[0])) # it is string

# selecting cols
print(df.breed) # or
#df['breed']
# in R df$name or in dpylr: df %>% select(name)

In [32]:
df

              breed  color  height_cm  weight_kg date_of_birth
name
Bella      Labrador  Brown         56         24    2013-07-01
Charlie      Poodle  Black         43         24    2016-09-16
Lucy       ChowChow  Brown         46         24    2014-08-25
Coooper   Schnauzer   Gray         49         17    2011-12-11
Max        Labrador  Black         59         29    2017-01-28
Stella    Chihuahua    Tan         18          2    2015-04-20
Bernie   St.Bernard  White         77         74    2018-02-27

In [68]:
# how would you get the age of each dog?
# you want to subtract each date_of_birth from today's date: 2024-09-27
import datetime as dt
import numpy as np
df['date_of_birth'] = pd.to_datetime(df.date_of_birth) # convert string date col into a datetime col via pandas
#dt.date.today() - df['date_of_birth'] # won't work
# instead, create a new col consisting of the date threshold
df['current_date'] = pd.to_datetime(dt.date.today())
df['age'] = np.round((df['current_date'] - df['date_of_birth']).dt.days/365 , 2)
df

,breed,color,height_cm,weight_kg,date_of_birth,current_date,age
name,,,,,,,
Bella,Labrador,Brown,56,24,2013-07-01,2024-09-27,11.25
Charlie,Poodle,Black,43,24,2016-09-16,2024-09-27,8.04
Lucy,ChowChow,Brown,46,24,2014-08-25,2024-09-27,10.10
Coooper,Schnauzer,Gray,49,17,2011-12-11,2024-09-27,12.81
Max,Labrador,Black,59,29,2017-01-28,2024-09-27,7.67
Stella,Chihuahua,Tan,18,2,2015-04-20,2024-09-27,9.45
Bernie,St.Bernard,White,77,74,2018-02-27,2024-09-27,6.59

In [58]:
df

              breed  color  height_cm  weight_kg date_of_birth current_date
name
Bella      Labrador  Brown         56         24    2013-07-01   2024-09-27
Charlie      Poodle  Black         43         24    2016-09-16   2024-09-27
Lucy       ChowChow  Brown         46         24    2014-08-25   2024-09-27
Coooper   Schnauzer   Gray         49         17    2011-12-11   2024-09-27
Max        Labrador  Black         59         29    2017-01-28   2024-09-27
Stella    Chihuahua    Tan         18          2    2015-04-20   2024-09-27
Bernie   St.Bernard  White         77         74    2018-02-27   2024-09-27

In [59]:
df['current_date']

name
Bella     2024-09-27
Charlie   2024-09-27
Lucy      2024-09-27
Coooper   2024-09-27
Max       2024-09-27
Stella    2024-09-27
Bernie    2024-09-27
Name: current_date, dtype: datetime64[ns]

In [75]:
# if you want to import a csv file into pandas
#topnames = pd.read_csv(r"C:\Users\bilene\Downloads\topnames.csv") # or
topnames = pd.read_csv(r"https://raw.githubusercontent.com/ernbilen/Data200_Fall24/refs/heads/main/data/topnames.csv")
topnames

     year     sex  name  count
0    1880  Female  Mary   7065
1    1880    Male  John   9655
2    1881  Female  Mary   6919
3    1881    Male  John   8769
4    1882  Female  Mary   8148
..    ...     ...   ...    ...
273  2016    Male  Noah  19117
274  2017  Female  Emma  19800
275  2017    Male  Liam  18798
276  2018  Female  Emma  18688
277  2018    Male  Liam  19837

[278 rows x 4 columns]

In [74]:
topnames.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278 entries, 0 to 277
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    278 non-null    int64
 1   sex     278 non-null    object
 2   name    278 non-null    object
 3   count   278 non-null    int64
dtypes: int64(2), object(2)
memory usage: 8.8+ KB

In [1]:
import pandas as pd
countries = pd.read_csv('https://raw.githubusercontent.com/ernbilen/Data200_Fall24/refs/heads/main/data/countries.csv')
countries

          country continent  year  lifeExpectancy  population  gdpPerCapita
0     Afghanistan      Asia  1952          28.801     8425333    779.445314
1     Afghanistan      Asia  1957          30.332     9240934    820.853030
2     Afghanistan      Asia  1962          31.997    10267083    853.100710
3     Afghanistan      Asia  1967          34.020    11537966    836.197138
4     Afghanistan      Asia  1972          36.088    13079460    739.981106
...           ...       ...   ...             ...         ...           ...
1699     Zimbabwe    Africa  1987          62.351     9216418    706.157306
1700     Zimbabwe    Africa  1992          60.377    10704340    693.420786
1701     Zimbabwe    Africa  1997          46.809    11404948    792.449960
1702     Zimbabwe    Africa  2002          39.989    11926563    672.038623
1703     Zimbabwe    Africa  2007          43.487    12311143    469.709298

[1704 rows x 6 columns]

In [27]:
countries.head(6) # default # of rows of 5

,country,continent,year,lifeExpectancy,population,gdpPerCapita
0,Afghanistan,Asia,1952,28.80,8425333,779.45
1,Afghanistan,Asia,1957,30.33,9240934,820.85
2,Afghanistan,Asia,1962,32.00,10267083,853.10
3,Afghanistan,Asia,1967,34.02,11537966,836.20
4,Afghanistan,Asia,1972,36.09,13079460,739.98
5,Afghanistan,Asia,1977,38.44,14880372,786.11

In [7]:
import numpy as np
pd.options.display.float_format = '{:20,.2f}'.format # this disables scientific notation
countries.describe()

,year,lifeExpectancy,population,gdpPerCapita
count,"1,704.00","1,704.00","1,704.00","1,704.00"
mean,"1,979.50",59.47,"29,601,212.32","7,215.33"
std,17.27,12.92,"106,157,896.74","9,857.45"
min,"1,952.00",23.60,"60,011.00",241.17
25%,"1,965.75",48.20,"2,793,664.00","1,202.06"
50%,"1,979.50",60.71,"7,023,595.50","3,531.85"
75%,"1,993.25",70.85,"19,585,221.75","9,325.46"
max,"2,007.00",82.60,"1,318,683,096.00","113,523.13"

In [8]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   country         1704 non-null   object
 1   continent       1704 non-null   object
 2   year            1704 non-null   int64
 3   lifeExpectancy  1704 non-null   float64
 4   population      1704 non-null   int64
 5   gdpPerCapita    1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [11]:
countries.country=='Zimbabwe'

0       False
1       False
2       False
3       False
4       False
        ...
1699     True
1700     True
1701     True
1702     True
1703     True
Name: country, Length: 1704, dtype: bool

In [15]:
# practice
# return the row for Zimbabwe, year 1992
# do it with .loc and .iloc
countries.loc[(countries.country=='Zimbabwe') & (countries.year==1992),] # uses conditions

,country,continent,year,lifeExpectancy,population,gdpPerCapita
1700,Zimbabwe,Africa,1992,60.38,10704340,693.42

In [16]:
countries.iloc[1700,:] # uses row index position

country                      Zimbabwe
continent                      Africa
year                             1992
lifeExpectancy                  60.38
population                   10704340
gdpPerCapita                   693.42
Name: 1700, dtype: object

In [17]:
countries[(countries.country=='Zimbabwe') & (countries.year==1992)] # third method (similar to in numpy)

,country,continent,year,lifeExpectancy,population,gdpPerCapita
1700,Zimbabwe,Africa,1992,60.38,10704340,693.42

In [21]:
# which country had the largest population recorded in this dataset?
countries.sort_values('population',ascending=False) # default is ascending=True
# answer: china

,country,continent,year,lifeExpectancy,population,gdpPerCapita
299,China,Asia,2007,72.96,1318683096,"4,959.11"
298,China,Asia,2002,72.03,1280400000,"3,119.28"
297,China,Asia,1997,70.43,1230075000,"2,289.23"
296,China,Asia,1992,68.69,1164970000,"1,655.78"
707,India,Asia,2007,64.70,1110396331,"2,452.21"
...,...,...,...,...,...,...
1299,Sao Tome and Principe,Africa,1967,54.42,70787,"1,384.84"
1298,Sao Tome and Principe,Africa,1962,51.89,65345,"1,071.55"
420,Djibouti,Africa,1952,34.81,63149,"2,669.53"
1297,Sao Tome and Principe,Africa,1957,48.95,61325,860.74
1296,Sao Tome and Principe,Africa,1952,46.47,60011,879.58

In [24]:
# does Sao Tome and Principe still exist in 2007?
countries.loc[(countries.country=='Sao Tome and Principe')&(countries.year==2007)]

,country,continent,year,lifeExpectancy,population,gdpPerCapita
1307,Sao Tome and Principe,Africa,2007,65.53,199579,"1,598.44"

In [29]:
# .agg() function
countries.agg({'lifeExpectancy':['mean','median'], 'gdpPerCapita':['median','mean']}) # if you want custom summary stats

             lifeExpectancy         gdpPerCapita
mean                  59.47             7,215.33
median                60.71             3,531.85

In [35]:
# .groupby() function
#countries.groupby('continent').mean()

countries.groupby('continent').mean(numeric_only=True).reset_index() # if you don't want continent col as index, 
# use reset_index()

,continent,year,lifeExpectancy,population,gdpPerCapita
0,Africa,"1,979.50",48.87,"9,916,003.14","2,193.75"
1,Americas,"1,979.50",64.66,"24,504,795.00","7,136.11"
2,Asia,"1,979.50",60.06,"77,038,721.97","7,902.15"
3,Europe,"1,979.50",71.90,"17,169,764.73","14,469.48"
4,Oceania,"1,979.50",74.33,"8,874,672.33","18,621.61"

In [36]:
# .agg() with .groupby()?
# get mean and median life Expectancy for each country in a table
countries.groupby('country').agg({'lifeExpectancy':['mean','median']})

                         lifeExpectancy
                                   mean               median
country
Afghanistan                       37.48                39.15
Albania                           68.43                69.68
Algeria                           59.03                59.69
Angola                            37.88                39.69
Argentina                         69.06                69.21
...                                 ...                  ...
Vietnam                           57.48                57.29
West Bank and Gaza                60.33                62.59
Yemen, Rep.                       46.78                46.64
Zambia                            46.00                46.06
Zimbabwe                          52.66                53.18

[142 rows x 2 columns]

In [41]:
# if you wanna remove cols or rows use .drop() with axis=0 or axis=1 option
# where axis=0 is for rows and axis=1 is for cols
my_copy = countries.copy() # creates a copy of the df so we don't lose work

In [44]:
#my_copy.drop(columns=['continent']) # or
my_copy.drop('continent',axis=1)

          country  year       lifeExpectancy  population         gdpPerCapita
0     Afghanistan  1952                28.80     8425333               779.45
1     Afghanistan  1957                30.33     9240934               820.85
2     Afghanistan  1962                32.00    10267083               853.10
3     Afghanistan  1967                34.02    11537966               836.20
4     Afghanistan  1972                36.09    13079460               739.98
...           ...   ...                  ...         ...                  ...
1699     Zimbabwe  1987                62.35     9216418               706.16
1700     Zimbabwe  1992                60.38    10704340               693.42
1701     Zimbabwe  1997                46.81    11404948               792.45
1702     Zimbabwe  2002                39.99    11926563               672.04
1703     Zimbabwe  2007                43.49    12311143               469.71

[1704 rows x 5 columns]

In [45]:
my_copy.drop(0,axis=0) # drops row index 0

,country,continent,year,lifeExpectancy,population,gdpPerCapita
1,Afghanistan,Asia,1957,30.33,9240934,820.85
2,Afghanistan,Asia,1962,32.00,10267083,853.10
3,Afghanistan,Asia,1967,34.02,11537966,836.20
4,Afghanistan,Asia,1972,36.09,13079460,739.98
5,Afghanistan,Asia,1977,38.44,14880372,786.11
...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.35,9216418,706.16
1700,Zimbabwe,Africa,1992,60.38,10704340,693.42
1701,Zimbabwe,Africa,1997,46.81,11404948,792.45
1702,Zimbabwe,Africa,2002,39.99,11926563,672.04
1703,Zimbabwe,Africa,2007,43.49,12311143,469.71

In [46]:
# if you wanna overwrite your df
# either do 
my_copy = my_copy.drop('continent',axis=1)
my_copy

          country  year       lifeExpectancy  population         gdpPerCapita
0     Afghanistan  1952                28.80     8425333               779.45
1     Afghanistan  1957                30.33     9240934               820.85
2     Afghanistan  1962                32.00    10267083               853.10
3     Afghanistan  1967                34.02    11537966               836.20
4     Afghanistan  1972                36.09    13079460               739.98
...           ...   ...                  ...         ...                  ...
1699     Zimbabwe  1987                62.35     9216418               706.16
1700     Zimbabwe  1992                60.38    10704340               693.42
1701     Zimbabwe  1997                46.81    11404948               792.45
1702     Zimbabwe  2002                39.99    11926563               672.04
1703     Zimbabwe  2007                43.49    12311143               469.71

[1704 rows x 5 columns]

In [47]:
# or
my_copy = countries.copy() # create a copy again
my_copy.drop('continent',axis=1,inplace=True)
my_copy

          country  year       lifeExpectancy  population         gdpPerCapita
0     Afghanistan  1952                28.80     8425333               779.45
1     Afghanistan  1957                30.33     9240934               820.85
2     Afghanistan  1962                32.00    10267083               853.10
3     Afghanistan  1967                34.02    11537966               836.20
4     Afghanistan  1972                36.09    13079460               739.98
...           ...   ...                  ...         ...                  ...
1699     Zimbabwe  1987                62.35     9216418               706.16
1700     Zimbabwe  1992                60.38    10704340               693.42
1701     Zimbabwe  1997                46.81    11404948               792.45
1702     Zimbabwe  2002                39.99    11926563               672.04
1703     Zimbabwe  2007                43.49    12311143               469.71

[1704 rows x 5 columns]

In [6]:
# isin() takes a list
# try to filter countries to "Zimbabwe", "Turkey", "Egypt"
# long version (not recommended)
countries[(countries.country == 'Zimbabwe') | (countries.country == 'Turkey') | \
         (countries.country=='Egypt')]

# isin() approach:
country_list = ['Zimbabwe','Turkey','Egypt']
countries[countries.country.isin(country_list)]

       country continent  year  lifeExpectancy  population  gdpPerCapita
456      Egypt    Africa  1952          41.893    22223309   1418.822445
457      Egypt    Africa  1957          44.444    25009741   1458.915272
458      Egypt    Africa  1962          46.992    28173309   1693.335853
459      Egypt    Africa  1967          49.293    31681188   1814.880728
460      Egypt    Africa  1972          51.137    34807417   2024.008147
461      Egypt    Africa  1977          53.319    38783863   2785.493582
462      Egypt    Africa  1982          56.006    45681811   3503.729636
463      Egypt    Africa  1987          59.797    52799062   3885.460710
464      Egypt    Africa  1992          63.674    59402198   3794.755195
465      Egypt    Africa  1997          67.217    66134291   4173.181797
466      Egypt    Africa  2002          69.806    73312559   4754.604414
467      Egypt    Africa  2007          71.338    80264543   5581.180998
1572    Turkey    Europe  1952          43.585    22235677   1969.100980
1573    Turkey    Europe  1957          48.079    25670939   2218.754257
1574    Turkey    Europe  1962          52.098    29788695   2322.869908
1575    Turkey    Europe  1967          54.336    33411317   2826.356387
1576    Turkey    Europe  1972          57.005    37492953   3450.696380
1577    Turkey    Europe  1977          59.507    42404033   4269.122326
1578    Turkey    Europe  1982          61.036    47328791   4241.356344
1579    Turkey    Europe  1987          63.108    52881328   5089.043686
1580    Turkey    Europe  1992          66.146    58179144   5678.348271
1581    Turkey    Europe  1997          68.835    63047647   6601.429915
1582    Turkey    Europe  2002          70.845    67308928   6508.085718
1583    Turkey    Europe  2007          71.777    71158647   8458.276384
1692  Zimbabwe    Africa  1952          48.451     3080907    406.884115
1693  Zimbabwe    Africa  1957          50.469     3646340    518.764268
1694  Zimbabwe    Africa  1962          52.358     4277736    527.272182
1695  Zimbabwe    Africa  1967          53.995     4995432    569.795071
1696  Zimbabwe    Africa  1972          55.635     5861135    799.362176
1697  Zimbabwe    Africa  1977          57.674     6642107    685.587682
1698  Zimbabwe    Africa  1982          60.363     7636524    788.855041
1699  Zimbabwe    Africa  1987          62.351     9216418    706.157306
1700  Zimbabwe    Africa  1992          60.377    10704340    693.420786
1701  Zimbabwe    Africa  1997          46.809    11404948    792.449960
1702  Zimbabwe    Africa  2002          39.989    11926563    672.038623
1703  Zimbabwe    Africa  2007          43.487    12311143    469.709298

In [10]:
# unique() func
countries.country.unique() # note that unique() returns a np array
# incase you want to be returned a series
pd.Series(countries.country.unique())

0             Afghanistan
1                 Albania
2                 Algeria
3                  Angola
4               Argentina
              ...
137               Vietnam
138    West Bank and Gaza
139           Yemen, Rep.
140                Zambia
141              Zimbabwe
Length: 142, dtype: object

In [36]:
# how many countries exist in each continent?
# value_counts()
#countries.continent.value_counts() # raw counts, note the repeated country obs
#countries.continent.value_counts(normalize=True) # returns proportions instead of raw counts

# try another (?) method, again think about how many "unique" countries
# hint: count() is relevant
# a second hint: drop_duplicates() function, which can optionally take a column as an input and drop duplicates
# fast soltn:
countries.drop_duplicates('country').groupby('continent')['country'].count()

# alternative, longer
countries.groupby(['continent','year'])['country'].count().reset_index().drop_duplicates('continent')

continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

In [78]:
# are there any countries in the dataset that stopped existing?
# also, any countries that popped up in the recent years?
# hint: groupby()
mydf = countries.groupby('country').count()['year'].reset_index().rename(columns={'year':'num_year'})
mydf

                country  num_year
0           Afghanistan        12
1               Albania        12
2               Algeria        12
3                Angola        12
4             Argentina        12
..                  ...       ...
137             Vietnam        12
138  West Bank and Gaza        12
139         Yemen, Rep.        12
140              Zambia        12
141            Zimbabwe        12

[142 rows x 2 columns]

In [83]:
mydf[mydf.num_year!=12]

Empty DataFrame
Columns: [country, num_year]
Index: []

In [73]:
# how many years exist in the data?
len(countries.year.unique())

12

In [109]:
# pd.concat()
countries

,country,continent,year,lifeExpectancy,population,gdpPerCapita
0,Afghanistan,Asia,1952,28.80,8425333,779.45
1,Afghanistan,Asia,1957,30.33,9240934,820.85
2,Afghanistan,Asia,1962,32.00,10267083,853.10
3,Afghanistan,Asia,1967,34.02,11537966,836.20
4,Afghanistan,Asia,1972,36.09,13079460,739.98
...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.35,9216418,706.16
1700,Zimbabwe,Africa,1992,60.38,10704340,693.42
1701,Zimbabwe,Africa,1997,46.81,11404948,792.45
1702,Zimbabwe,Africa,2002,39.99,11926563,672.04
1703,Zimbabwe,Africa,2007,43.49,12311143,469.71

In [87]:
countries.columns

Index(['country', 'continent', 'year', 'lifeExpectancy', 'population',
       'gdpPerCapita'],
      dtype='object')

In [88]:
myrow = pd.DataFrame([['Zimbabwe','Africa','2011',44.01,12500000,700.5]],columns=countries.columns)
myrow

    country continent  year  lifeExpectancy  population  gdpPerCapita
0  Zimbabwe    Africa  2011           44.01    12500000         700.5

In [91]:
# concatenating rows
pd.concat([countries,myrow],axis=0).reset_index(drop=True)

          country continent  year  lifeExpectancy  population  gdpPerCapita
0     Afghanistan      Asia  1952          28.801     8425333    779.445314
1     Afghanistan      Asia  1957          30.332     9240934    820.853030
2     Afghanistan      Asia  1962          31.997    10267083    853.100710
3     Afghanistan      Asia  1967          34.020    11537966    836.197138
4     Afghanistan      Asia  1972          36.088    13079460    739.981106
...           ...       ...   ...             ...         ...           ...
1700     Zimbabwe    Africa  1992          60.377    10704340    693.420786
1701     Zimbabwe    Africa  1997          46.809    11404948    792.449960
1702     Zimbabwe    Africa  2002          39.989    11926563    672.038623
1703     Zimbabwe    Africa  2007          43.487    12311143    469.709298
1704     Zimbabwe    Africa  2011          44.010    12500000    700.500000

[1705 rows x 6 columns]

In [98]:
# concentating columns
pd.options.display.float_format = '{:20,.2f}'.format
mycol = pd.DataFrame(countries['population'] * countries['gdpPerCapita'],columns=['GDP'])

In [100]:
pd.concat([countries,mycol],axis=1)

,country,continent,year,lifeExpectancy,population,gdpPerCapita,GDP
0,Afghanistan,Asia,1952,28.80,8425333,779.45,"6,567,086,329.95"
1,Afghanistan,Asia,1957,30.33,9240934,820.85,"7,585,448,670.23"
2,Afghanistan,Asia,1962,32.00,10267083,853.10,"8,758,855,796.93"
3,Afghanistan,Asia,1967,34.02,11537966,836.20,"9,648,014,149.85"
4,Afghanistan,Asia,1972,36.09,13079460,739.98,"9,678,553,274.07"
...,...,...,...,...,...,...,...
1699,Zimbabwe,Africa,1987,62.35,9216418,706.16,"6,508,240,904.93"
1700,Zimbabwe,Africa,1992,60.38,10704340,693.42,"7,422,611,852.13"
1701,Zimbabwe,Africa,1997,46.81,11404948,792.45,"9,037,850,589.82"
1702,Zimbabwe,Africa,2002,39.99,11926563,672.04,"8,015,110,972.06"
1703,Zimbabwe,Africa,2007,43.49,12311143,469.71,"5,782,658,337.34"

In [105]:
usa = countries[countries.country=='United States'].reset_index(drop=True)
usa

,country,continent,year,lifeExpectancy,population,gdpPerCapita
0,United States,Americas,1952,68.44,157553000,"13,990.48"
1,United States,Americas,1957,69.49,171984000,"14,847.13"
2,United States,Americas,1962,70.21,186538000,"16,173.15"
3,United States,Americas,1967,70.76,198712000,"19,530.37"
4,United States,Americas,1972,71.34,209896000,"21,806.04"
5,United States,Americas,1977,73.38,220239000,"24,072.63"
6,United States,Americas,1982,74.65,232187835,"25,009.56"
7,United States,Americas,1987,75.02,242803533,"29,884.35"
8,United States,Americas,1992,76.09,256894189,"32,003.93"
9,United States,Americas,1997,76.81,272911760,"35,767.43"
10,United States,Americas,2002,77.31,287675526,"39,097.10"
11,United States,Americas,2007,78.24,301139947,"42,951.65"

In [102]:
# pd.merge() to merge two (or more) dfs based on common variables
topnames = pd.read_csv('https://raw.githubusercontent.com/ernbilen/Data200_Fall24/refs/heads/main/data/topnames.csv')
topnames

     year     sex  name  count
0    1880  Female  Mary   7065
1    1880    Male  John   9655
2    1881  Female  Mary   6919
3    1881    Male  John   8769
4    1882  Female  Mary   8148
..    ...     ...   ...    ...
273  2016    Male  Noah  19117
274  2017  Female  Emma  19800
275  2017    Male  Liam  18798
276  2018  Female  Emma  18688
277  2018    Male  Liam  19837

[278 rows x 4 columns]

In [107]:
#pd.merge()
usa.merge(topnames,on=['year']) # how='inner' is the default

,country,continent,year,lifeExpectancy,population,gdpPerCapita,sex,name,count
0,United States,Americas,1952,68.44,157553000,"13,990.48",Female,Linda,67082
1,United States,Americas,1952,68.44,157553000,"13,990.48",Male,James,87063
2,United States,Americas,1957,69.49,171984000,"14,847.13",Female,Mary,61094
3,United States,Americas,1957,69.49,171984000,"14,847.13",Male,Michael,92704
4,United States,Americas,1962,70.21,186538000,"16,173.15",Female,Lisa,46078
5,United States,Americas,1962,70.21,186538000,"16,173.15",Male,Michael,85034
6,United States,Americas,1967,70.76,198712000,"19,530.37",Female,Lisa,52435
7,United States,Americas,1967,70.76,198712000,"19,530.37",Male,Michael,82436
8,United States,Americas,1972,71.34,209896000,"21,806.04",Female,Jennifer,63603
9,United States,Americas,1972,71.34,209896000,"21,806.04",Male,Michael,71405
10,United States,Americas,1977,73.38,220239000,"24,072.63",Female,Jennifer,58964
11,United States,Americas,1977,73.38,220239000,"24,072.63",Male,Michael,67616
12,United States,Americas,1982,74.65,232187835,"25,009.56",Female,Jennifer,57117
13,United States,Americas,1982,74.65,232187835,"25,009.56",Male,Michael,68235
14,United States,Americas,1987,75.02,242803533,"29,884.35",Female,Jessica,55994
15,United States,Americas,1987,75.02,242803533,"29,884.35",Male,Michael,63655
16,United States,Americas,1992,76.09,256894189,"32,003.93",Female,Ashley,38453
17,United States,Americas,1992,76.09,256894189,"32,003.93",Male,Michael,54392
18,United States,Americas,1997,76.81,272911760,"35,767.43",Female,Emily,25732
19,United States,Americas,1997,76.81,272911760,"35,767.43",Male,Michael,37549
20,United States,Americas,2002,77.31,287675526,"39,097.10",Female,Emily,24464
21,United States,Americas,2002,77.31,287675526,"39,097.10",Male,Jacob,30574
22,United States,Americas,2007,78.24,301139947,"42,951.65",Female,Emily,19355
23,United States,Americas,2007,78.24,301139947,"42,951.65",Male,Jacob,24282

In [ ]:
mydf = countries.groupby(['country']).count().continent.reset_index().rename(columns={'continent':'tot_count'})
mydf[mydf.tot_count<12]